---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier
source: html/f0f086e3-ab42-a460-1a05-aab450d4417e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier

Level of computation for energy analysis model.

## Syntax (C#)
```csharp
public enum EnergyAnalysisDetailModelTier
```